2020.07.27 실습자료 5,6 참고   
2020.08.06 추가

### Pandas 실습
1. group
2. df.duplicated()
3. date type
4. map()
5. concat(), append(), merge(), join()

In [1]:
import pandas as pd

In [2]:
student_list = [
    {'name':'kang', 'sex':'female','major':'Computer Science'},
    {'name':'hana', 'sex':'male','major':'python'},
    {'name':'hong', 'sex':'male','major':'java'},
    {'name':'esther', 'sex':'female','major':'Computer Science'},
    {'name':'kim', 'sex':'female','major':'java'},
    {'name':'nara', 'sex':'male','major':'python'},
    {'name':'lee', 'sex':'female','major':'Computer Science'},
    {'name':'haha', 'sex':'female','major':'java'},
    {'name':'hohee', 'sex':'male','major':'python'},
    {'name':'leejo', 'sex':'female','major':'Computer Science'},
]
df = pd.DataFrame(student_list)
df

              major    name     sex
0  Computer Science    kang  female
1            python    hana    male
2              java    hong    male
3  Computer Science  esther  female
4              java     kim  female
5            python    nara    male
6  Computer Science     lee  female
7              java    haha  female
8            python   hohee    male
9  Computer Science   leejo  female

In [3]:
type(student_list)

list

In [4]:
major_group = df.groupby('major')
major_group.groups

{'Computer Science': Int64Index([0, 3, 6, 9], dtype='int64'),
 'java': Int64Index([2, 4, 7], dtype='int64'),
 'python': Int64Index([1, 5, 8], dtype='int64')}

In [5]:
type(major_group) # dictionary 형태임

pandas.core.groupby.groupby.DataFrameGroupBy

In [6]:
'''
groups : dict
    {group name -> group labels}
len(grouped) : int
    Number of groups
'''
major_group.groups['Computer Science']

Int64Index([0, 3, 6, 9], dtype='int64')

In [7]:
for name, group in major_group.groups.items():
    print(name,":",group)

Computer Science : Int64Index([0, 3, 6, 9], dtype='int64')
java : Int64Index([2, 4, 7], dtype='int64')
python : Int64Index([1, 5, 8], dtype='int64')

In [8]:
for name, group in major_group:
    print(name,":",group)

Computer Science :               major    name     sex
0  Computer Science    kang  female
3  Computer Science  esther  female
6  Computer Science     lee  female
9  Computer Science   leejo  female
java :   major  name     sex
2  java  hong    male
4  java   kim  female
7  java  haha  female
python :     major   name   sex
1  python   hana  male
5  python   nara  male
8  python  hohee  male

In [9]:
for name, group in major_group:
    print(name,":",len(group))

Computer Science : 4
java : 3
python : 3

In [10]:
sex_group = df.groupby('sex')
for name, group in sex_group:
    print(name,":",len(group))
    print(group)

female : 6
              major    name     sex
0  Computer Science    kang  female
3  Computer Science  esther  female
4              java     kim  female
6  Computer Science     lee  female
7              java    haha  female
9  Computer Science   leejo  female
male : 4
    major   name   sex
1  python   hana  male
2    java   hong  male
5  python   nara  male
8  python  hohee  male

### df.duplicated()

In [11]:
student_list2 = [
    {'name':'kang', 'sex':'female','major':'Computer Science'},
    {'name':'hana', 'sex':'male','major':'python'},
    {'name':'hong', 'sex':'male','major':'java'},
    {'name':'esther', 'sex':'female','major':'Computer Science'},
    {'name':'kim', 'sex':'female','major':'java'},
    {'name':'nara', 'sex':'male','major':'python'},
    {'name':'lee', 'sex':'female','major':'Computer Science'},
    {'name':'haha', 'sex':'female','major':'java'},
    {'name':'hohee', 'sex':'male','major':'python'},
    {'name':'leejo', 'sex':'female','major':'Computer Science'},
    {'name':'kang', 'sex':'male','major':'Computer Science'},
]

In [12]:
df2 = pd.DataFrame(student_list2)

In [13]:
df2.duplicated() # 모든 속성이 동일해야 return True

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
dtype: bool

- 기준을 정할 수도 있음.

In [14]:
df2.duplicated(['name'])

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
dtype: bool

## 삭제 `df.drop_duplicates()`
### keep{‘first’, ‘last’, False}, default ‘first’
- Determines which duplicates (if any) to keep. 
- first : Drop duplicates except for the first occurrence.
- last : Drop duplicates except for the last occurrence. 
- False : Drop all duplicates.

In [15]:
df2 = df2.drop_duplicates(['name'],keep='last')

In [16]:
df2 # 중복된 row들 중 마지막이 남아있는 것을 볼 수 있음

               major    name     sex
1             python    hana    male
2               java    hong    male
3   Computer Science  esther  female
4               java     kim  female
5             python    nara    male
6   Computer Science     lee  female
7               java    haha  female
8             python   hohee    male
9   Computer Science   leejo  female
10  Computer Science    kang    male

###  Date Type

In [17]:
date_list = [
    {'yyyy-mm-dd':'2003-04-18'},
    {'yyyy-mm-dd':'2010-05-12'},
    {'yyyy-mm-dd':'2020-07-27'},
]
df3 = pd.DataFrame(date_list, columns= ['yyyy-mm-dd'])
df3

   yyyy-mm-dd
0  2003-04-18
1  2010-05-12
2  2020-07-27

In [19]:
# method 1
df3['year'] = pd.to_datetime(df3['yyyy-mm-dd'], format='%Y-%m-%d %H:%M:%S', errors='raise').dt.year
df3

   yyyy-mm-dd  year
0  2003-04-18  2003
1  2010-05-12  2010
2  2020-07-27  2020

In [20]:
# method 2
def get_year(column):
    return column.split('-')[0]
get_year('2002-09-09')

'2002'

In [21]:
df3['year'] = df3['yyyy-mm-dd'].apply(get_year)
df3

   yyyy-mm-dd  year
0  2003-04-18  2003
1  2010-05-12  2010
2  2020-07-27  2020

In [22]:
df3['year_map'] = df3['yyyy-mm-dd'].map(get_year)
df3

   yyyy-mm-dd  year year_map
0  2003-04-18  2003     2003
1  2010-05-12  2010     2010
2  2020-07-27  2020     2020

##  map()
Map values of Series using input correspondence (a dict, Series, or
function).

In [26]:
student_list = [
    {'name':'kang','sex':'female','major':'Computer Science'},
    {'name':'hana','sex':'male','major':'python'},
    {'name':'hong','sex':'male','major':'java'},
    {'name':'esther','sex':'female','major':'Computer Science'},
    {'name':'kim','sex':'female','major':'java'},
    {'name':'nara','sex':'male','major':'python'},
    {'name':'lee','sex':'female','major':'Computer Science'},
    {'name':'haha','sex':'female','major':'java'},
    {'name':'hohee','sex':'male','major':'python'},
    {'name':'leejo','sex':'female','major':'Computer Science'},
]
df = pd.DataFrame(student_list,columns=['name','sex','major'])
df

     name     sex             major
0    kang  female  Computer Science
1    hana    male            python
2    hong    male              java
3  esther  female  Computer Science
4     kim  female              java
5    nara    male            python
6     lee  female  Computer Science
7    haha  female              java
8   hohee    male            python
9   leejo  female  Computer Science

In [27]:
df.major = df.major.map({'Computer Science':1, 'python':2,'java':3})
df

     name     sex  major
0    kang  female      1
1    hana    male      2
2    hong    male      3
3  esther  female      1
4     kim  female      3
5    nara    male      2
6     lee  female      1
7    haha  female      3
8   hohee    male      2
9   leejo  female      1

## merge

In [28]:
list1 = [ {'name':'esther','lang':'python'},
         {'name':'kim','lang':'java'},
         {'name':'hong','lang':'c'},]
list2 = [
     {'name':'esther','lang':'go'},
     {'name':'lee','lang':'R'},
     {'name':'park','lang':'cobol'}
]
df1 = pd.DataFrame(list1)
df2 = pd.DataFrame(list2)

In [29]:
df1

     lang    name
0  python  esther
1    java     kim
2       c    hong

In [30]:
df2

    lang    name
0     go  esther
1      R     lee
2  cobol    park

###  concat()
Signature: pd.concat(objs, axis=0, join='outer', join_axes=None, ignore_index=False, keys=None, levels=None, names=None, verify_integrity=False, sort=None, copy=True)   
Docstring:   
**Concatenate pandas objects along a particular axis** with optional set logic
along the other axes.

In [31]:
result_df = pd.concat([df1,df2])
result_df

     lang    name
0  python  esther
1    java     kim
2       c    hong
0      go  esther
1       R     lee
2   cobol    park

In [33]:
result_df = pd.concat([df1,df2],ignore_index=True)
result_df

     lang    name
0  python  esther
1    java     kim
2       c    hong
3      go  esther
4       R     lee
5   cobol    park

### append()
Signature: df1.append(other, ignore_index=False, verify_integrity=False, sort=None)   
Docstring:   
**Append rows of `other` to the end of this frame**, returning a new
object. Columns not in this frame are added as new columns.

In [34]:
df1.append(df2)

     lang    name
0  python  esther
1    java     kim
2       c    hong
0      go  esther
1       R     lee
2   cobol    park

In [35]:
df1.append(df2, ignore_index = True)

     lang    name
0  python  esther
1    java     kim
2       c    hong
3      go  esther
4       R     lee
5   cobol    park

In [36]:
list3 = [
    {"age":23, 'address':'경기도 고양시'},
    {"age":35, 'address':'서울시 강남구'},
    {"age":28, 'address':'서울시 영등포구'},
]
df3 = pd.DataFrame(list3, columns=['age','address'])
df3

   age   address
0   23   경기도 고양시
1   35   서울시 강남구
2   28  서울시 영등포구

### axis=1(column) 으로 concat()
- axis : {0/'index', 1/'columns'}, default 0
    The axis to concatenate along.

In [39]:
result_col = pd.concat([df1,df3],axis = 1) # axis default는 0 (row) 
result_col

     lang    name  age   address
0  python  esther   23   경기도 고양시
1    java     kim   35   서울시 강남구
2       c    hong   28  서울시 영등포구

### join
- pd.merge : pandas 함수
- join : DataFrame 함수

In [46]:
emp_df = pd.read_csv('pandas_data\employees.csv',index_col=0)
dept_df = pd.read_csv('pandas_data\department.csv',index_col=0)

In [47]:
emp_df.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,100,Steven,King,SKING,515.123.4567,2003-06-17,AD_PRES,24000.0,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,2005-09-21,AD_VP,17000.0,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13,AD_VP,17000.0,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,2006-01-03,IT_PROG,9000.0,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,2007-05-21,IT_PROG,6000.0,NaN,103.0,60.0

In [48]:
dept_df.head()

   DEPARTMENT_ID  DEPARTMENT_NAME  MANAGER_ID  LOCATION_ID
0             10   Administration       200.0         1700
1             20        Marketing       201.0         1800
2             30       Purchasing       114.0         1700
3             40  Human Resources       203.0         2400
4             50         Shipping       121.0         1500

In [43]:
pd.merge(emp_df,dept_df, on='DEPARTMENT_ID',how = 'left' )

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID_x,DEPARTMENT_ID,Unnamed: 0,DEPARTMENT_NAME,MANAGER_ID_y,LOCATION_ID
0,100,Steven,King,SKING,515.123.4567,2003-06-17,AD_PRES,24000.0,NaN,NaN,90.0,8.0,Executive,100.0,1700.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,2005-09-21,AD_VP,17000.0,NaN,100.0,90.0,8.0,Executive,100.0,1700.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13,AD_VP,17000.0,NaN,100.0,90.0,8.0,Executive,100.0,1700.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,2006-01-03,IT_PROG,9000.0,NaN,102.0,60.0,5.0,IT,103.0,1400.0
4,104,Bruce,Ernst,BERNST,590.423.4568,2007-05-21,IT_PROG,6000.0,NaN,103.0,60.0,5.0,IT,103.0,1400.0
5,105,David,Austin,DAUSTIN,590.423.4569,2005-06-25,IT_PROG,4800.0,NaN,103.0,60.0,5.0,IT,103.0,1400.0
6,106,Valli,Pataballa,VPATABAL,590.423.4560,2006-02-05,IT_PROG,4800.0,NaN,103.0,60.0,5.0,IT,103.0,1400.0
7,107,Diana,Lorentz,DLORENTZ,590.423.5567,2007-02-07,IT_PROG,4200.0,NaN,103.0,60.0,5.0,IT,103.0,1400.0
8,108,Nancy,Greenberg,NGREENBE,515.124.4569,2002-08-17,FI_MGR,12008.0,NaN,101.0,100.0,9.0,Finance,108.0,1700.0
9,109,Daniel,Faviet,DFAVIET,515.124.4169,2002-08-16,FI_ACCOUNT,9000.0,NaN,108.0,100.0,9.0,Finance,108.0,1700.0
10,110,John,Chen,JCHEN,515.124.4269,2005-09-28,FI_ACCOUNT,8200.0,NaN,108.0,100.0,9.0,Finance,108.0,1700.0
11,111,Ismael,Sciarra,ISCIARRA,515.124.4369,2005-09-30,FI_ACCOUNT,7700.0,NaN,108.0,100.0,9.0,Finance,108.0,1700.0
12,112,Jose Manuel,Urman,JMURMAN,515.124.4469,2006-03-07,FI_ACCOUNT,7800.0,NaN,108.0,100.0,9.0,Finance,108.0,1700.0
13,113,Luis,Popp,LPOPP,515.124.4567,2007-12-07,FI_ACCOUNT,6900.0,NaN,108.0,100.0,9.0,Finance,108.0,1700.0
14,114,Den,Raphaely,DRAPHEAL,515.127.4561,2002-12-07,PU_MAN,11000.0,NaN,100.0,30.0,2.0,Purchasing,114.0,1700.0
15,115,Alexander,Khoo,AKHOO,515.127.4562,2003-05-18,PU_CLERK,3100.0,NaN,114.0,30.0,2.0,Purchasing,114.0,1700.0
16,116,Shelli,Baida,SBAIDA,515.127.4563,2005-12-24,PU_CLERK,2900.0,NaN,114.0,30.0,2.0,Purchasing,114.0,1700.0
17,117,Sigal,Tobias,STOBIAS,515.127.4564,2005-07-24,PU_CLERK,2800.0,NaN,114.0,30.0,2.0,Purchasing,114.0,1700.0
18,118,Guy,Himuro,GHIMURO,515.127.4565,2006-11-15,PU_CLERK,2600.0,NaN,114.0,30.0,2.0,Purchasing,114.0,1700.0
19,119,Karen,Colmenares,KCOLMENA,515.127.4566,2007-08-10,PU_CLERK,2500.0,NaN,114.0,30.0,2.0,Purchasing,114.0,1700.0
20,120,Matthew,Weiss,MWEISS,650.123.1234,2004-07-18,ST_MAN,8000.0,NaN,100.0,50.0,4.0,Shipping,121.0,1500.0
21,121,Adam,Fripp,AFRIPP,650.123.2234,2005-04-10,ST_MAN,8200.0,NaN,100.0,50.0,4.0,Shipping,121.0,1500.0
22,122,Payam,Kaufling,PKAUFLIN,650.123.3234,2003-05-01,ST_MAN,7900.0,NaN,100.0,50.0,4.0,Shipping,121.0,1500.0
23,123,Shanta,Vollman,SVOLLMAN,650.123.4234,2005-10-10,ST_MAN,6500.0,NaN,100.0,50.0,4.0,Shipping,121.0,1500.0
24,124,Kevin,Mourgos,KMOURGOS,650.123.5234,2007-11-16,ST_MAN,5800.0,NaN,100.0,50.0,4.0,Shipping,121.0,1500.0
25,125,Julia,Nayer,JNAYER,650.124.1214,2005-07-16,ST_CLERK,3200.0,NaN,120.0,50.0,4.0,Shipping,121.0,1500.0
26,126,Irene,Mikkilineni,IMIKKILI,650.124.1224,2006-09-28,ST_CLERK,2700.0,NaN,120.0,50.0,4.0,Shipping,121.0,1500.0
27,127,James,Landry,JLANDRY,650.124.1334,2007-01-14,ST_CLERK,2400.0,NaN,120.0,50.0,4.0,Shipping,121.0,1500.0
28,128,Steven,Markle,SMARKLE,650.124.1434,2008-03-08,ST_CLERK,2200.0,NaN,120.0,50.0,4.0,Shipping,121.0,1500.0
29,129,Laura,Bissot,LBISSOT,650.124.5234,2005-08-20,ST_CLERK,3300.0,NaN,121.0,50.0,4.0,Shipping,121.0,1500.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
77,177,Jack,Livingston,JLIVINGS,011.44.1644.429264,2006-04-23,SA_REP,8400.0,0.20,149.0,80.0,7.0,Sales,145.0,2500.0
78,178,Kimberely,Grant,KGRANT,011.44.1644.429263,2007-05-24,SA_REP,7000.0,0.15,149.0,NaN,NaN,NaN,NaN,NaN
79,179,Charles,Johnson,CJOHNSON,011.44.1644.429262,2008-01-04,SA_REP,6200.0,0.10,149.0,80.0,7.0,Sales,145.0,2500.0
80,180,Winston,Taylor,WTAYLOR,650.507.9876,2006-01-24,SH_CLERK,3200.0,NaN,120.0,50.0,4.0,Shipping,121.0,1500.0
81,181,Jean,Fleaur,JFLEAUR,650.507.9877,2006-02-23,SH_CLERK,3100.0,NaN,120.0,50.0,4.0,Shipping,121.0,1500.0
82,182,Martha,Sullivan,MSULLIVA,650.507.9878,2007-06-21,SH_CLERK,2500.0,NaN,120.0,50.0,4.0,Shipping,121.0,1500.0
83,183,Girard,Geoni,GGEONI,650.507.9879,2008-02-03,SH_CLERK,2800.0,NaN,120.0,50.0,4.0,Shipping,121.0,1500.0
84,184,Nandita,Sarchand,NSARCHAN,650.509.1876,2004-01-27,SH_CLERK,4200.0,NaN,121.0,50.0,4.0,Shipping,121.0,1500.0
85,185,Alexis,Bull,ABULL,650.509.2876,2005-02-20,SH_CLERK,4100.0,NaN,121.0,50.0,4.0,Shipping,121.0,1500.0
86,186,Julia,Dellinger,JDELLING,650.509.3876,2006-06-24,SH_CLERK,3400.0,NaN,121.0,50.0,4.0,Shipping,121.0,1500.0
87,187,Anthony,Cabrio,ACABRIO,650.509.4876,2007-02-07,SH_CLERK,3000.0,NaN,121.0,50.0,4.0,Shipping,121.0,1500.0
88,188,Kelly,Chung,KCHUNG,650.505.1876,2005-06-14,SH_CLERK,3800.0,NaN,122.0,50.0,4.0,Shipping,121.0,1500.0
89,189,Jennifer,Dilly,JDILLY,650.505.2876,2005-08-13,SH_CLERK,3600.0,NaN,122.0,50.0,4.0,Shipping,121.0,1500.0
90,190,Timothy,Gates,TGATES,650.505.3876,2006-07-11,SH_CLERK,2900.0,NaN,122.0,50.0,4.0,Shipping,121.0,1500.0
91,191,Randall,Perkins,RPERKINS,650.505.4876,2007-12-19,SH_CLERK,2500.0,NaN,122.0,50.0,4.0,Shipping,121.0,1500.0
92,192,Sarah,Bell,SBELL,650.501.1876,2004-02-04,SH_CLERK,4000.0,NaN,123.0,50.0,4.0,Shipping,121.0,1500.0
93,193,Britney,Everett,BEVERETT,650.501.2876,2005-03-03,SH_CLERK,3900.0,NaN,123.0,50.0,4.0,Shipping,121.0,1500.0
94,194,Samuel,McCain,SMCCAIN,650.501.3876,2006-07-01,SH_CLERK,3200.0,NaN,123.0,50.0,4.0,Shipping,121.0,1500.0
95,195,Vance,Jones,VJONES,650.501.4876,2007-03-17,SH_CLERK,2800.0,NaN,123.0,50.0,4.0,Shipping,121.0,1500.0
96,196,Alana,Walsh,AWALSH,650.507.9811,2006-04-24,SH_CLERK,3100.0,NaN,124.0,50.0,4.0,Shipping,121.0,1500.0
97,197,Kevin,Feeney,KFEENEY,650.507.9822,2006-05-23,SH_CLERK,3000.0,NaN,124.0,50.0,4.0,Shipping,121.0,1500.0
98,198,Donald,OConnell,DOCONNEL,650.507.9833,2007-06-21,SH_CLERK,2600.0,NaN,124.0,50.0,4.0,Shipping,121.0,1500.0
99,199,Douglas,Grant,DGRANT,650.507.9844,2008-01-13,SH_CLERK,2600.0,NaN,124.0,50.0,4.0,Shipping,121.0,1500.0
100,200,Jennifer,Whalen,JWHALEN,515.123.4444,2003-09-17,AD_ASST,4400.0,NaN,101.0,10.0,0.0,Administration,200.0,1700.0
101,201,Michael,Hartstein,MHARTSTE,515.123.5555,2004-02-17,MK_MAN,13000.0,NaN,100.0,20.0,1.0,Marketing,201.0,1800.0
102,202,Pat,Fay,PFAY,603.123.6666,2005-08-17,MK_REP,6000.0,NaN,201.0,20.0,1.0,Marketing,201.0,1800.0
103,203,Susan,Mavris,SMAVRIS,515.123.7777,2002-06-07,HR_REP,6500.0,NaN,101.0,40.0,3.0,Human Resources,203.0,2400.0
104,204,Hermann,Baer,HBAER,515.123.8888,2002-06-07,PR_REP,10000.0,NaN,101.0,70.0,6.0,Public Relations,204.0,2700.0
105,205,Shelley,Higgins,SHIGGINS,515.123.8080,2002-06-07,AC_MGR,12008.0,NaN,101.0,110.0,10.0,Accounting,205.0,1700.0
106,206,William,Gietz,WGIETZ,515.123.8181,2002-06-07,AC_ACCOUNT,8300.0,NaN,205.0,110.0,10.0,Accounting,205.0,1700.0